{
  "backend/main.mo": "Main actor defining all types (theme preferences, hero section themes, particles, motion effects, clinics, services, social media, etc.) and including authorization and blob storage mixins with migration support.",
  "backend/migration.mo": "Migration module defining OldActor type with homepageTextFormatting structure for various sections (hero, overview, services, footer) and a run function that currently returns empty state.",
  "feature_evidence.json": "Feature evidence report documenting three features for reverting Version 63 changes: restoring frontend components to Version 62, removing TextFormattingManager, and removing text formatting props from homepage components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing their functionality, including App.tsx with routing and error handling, hooks for backend queries, and various UI components with static text styling.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS variables for light and dark themes including background, foreground, primary, secondary, accent, and other UI colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Dr. Malay Akechan - General Physician', root div, and module script loading main.tsx.",
  "frontend/src/.well-known/ic-domains": "Internet Computer domain configuration file specifying 'drmalay.in' as the custom domain.",
  "frontend/src/App.tsx": "Main React application with ErrorBoundary, ThemeProvider, authentication state management, hash-based routing between home and blogs views, ProfileSetupModal, and conditional AdminPanel rendering.",
  "frontend/src/components/About.tsx": "About section component with static text styling, loading skeletons, EditableContent for admin inline editing, DoctorCredentialsCard integration, and animated background accent elements.",
  "frontend/src/components/admin/ClinicsManager.tsx": "Admin interface for managing clinic entries with CRUD operations, image upload with progress tracking, and form fields for name, address, contact details, hours, map link, and booking URL.",
  "frontend/src/components/admin/ContentManager.tsx": "Admin component for managing website images (hero background, doctor photos, clinic images) and hero section content (headline, subtext, buttons). Supports light/dark mode image uploads with preview and CRUD operations.",
  "frontend/src/components/admin/FooterManager.tsx": "Admin component for managing footer content including contact information, copyright text, custom sections with drag-and-drop reordering, and quick links. Tracks changes and provides save functionality.",
  "frontend/src/components/admin/HeroThemeManager.tsx": "Admin component for configuring hero section visual theme settings including theme type, particle effects, motion effects, vector effects, and spacing. Provides UI controls for adjusting appearance parameters.",
  "frontend/src/components/admin/ReviewsManager.tsx": "Admin component for managing patient reviews with CRUD operations, star ratings, optional patient images, and review panel settings. Includes submission guards to prevent duplicate submissions and tabbed interface for reviews and settings.",
  "frontend/src/components/admin/ServicesManager.tsx": "Admin component for managing medical services with basic CRUD operations. Provides dialog-based form for adding/editing service name and description with confirmation for deletions.",
  "frontend/src/components/admin/SocialMediaManager.tsx": "Admin component for managing social media links with CRUD operations, including platform, display name, URL, icon size, order, and visibility settings.",
  "frontend/src/components/admin/TextFormattingManager.tsx": "Empty file with no content.",
  "frontend/src/components/AdminPanel.tsx": "Main admin panel component with tabbed interface for managing content, hero theme, clinics, services, reviews, social media, and footer sections. Includes a close button and renders specialized manager components for each tab.",
  "frontend/src/components/blogs/BlogDetail.tsx": "Displays a single blog post with formatted date, author, optional edit button for admins, and renders rich content using RichContentRenderer.",
  "frontend/src/components/blogs/BlogList.tsx": "Displays a list of blog posts sorted by creation date with preview text, admin edit/delete controls, and confirmation dialog for deletions.",
  "frontend/src/components/blogs/BlogPostEditorDialog.tsx": "Dialog component for creating and editing blog posts with support for multiple content blocks (text and images), image upload with progress tracking, and rich text editing.",
  "frontend/src/components/blogs/RichContentRenderer.tsx": "Renders blog post content elements including formatted HTML text, plain text, images with captions, and videos with descriptions.",
  "frontend/src/components/blogs/RichTextEditor.tsx": "WYSIWYG rich text editor with toolbar for formatting (headings, bold, italic, underline, lists, links, quotes) using contentEditable and execCommand.",
  "frontend/src/components/BlogsPage.tsx": "Blog listing and detail page component that displays all blog posts, handles post selection, and provides admin functionality for creating/editing posts via a dialog. Shows loading skeletons and empty states for non-admin users.",
  "frontend/src/components/Clinics.tsx": "Displays a grid of clinic cards with location, contact, and hours information. Includes loading skeletons, error handling, and hides section for non-admin users when no clinics exist.",
  "frontend/src/components/DoctorCredentialsCard.tsx": "Card component displaying doctor's professional credentials including name, qualifications, specializations, experience, and achievements. Provides admin edit dialog and editable profile image functionality.",
  "frontend/src/components/EditableContent.tsx": "Reusable component for inline editing of website content fields (overview/about). Shows edit button for admins, textarea editor on click, and handles save/cancel actions with mutation hooks.",
  "frontend/src/components/EditableFooterContent.tsx": "Inline editable component for footer fields (address, phone, email, copyright). Provides admin-only edit mode with input field and save/cancel buttons, updating footer content via mutation.",
  "frontend/src/components/EditableHeroContent.tsx": "Provides an editable component for hero section content (headline, subtext, buttons) with admin-only edit dialog. Supports inline editing with visual hover effects and handles content updates via mutation hooks.",
  "frontend/src/components/EditableImage.tsx": "Renders an editable image component with admin upload functionality supporting both light and dark mode variants. Handles image upload with progress tracking and displays placeholder when no image exists.",
  "frontend/src/components/Footer.tsx": "Displays the website footer with contact info, quick links, custom sections, and social media icons. Uses editable footer content components for admin users and shows loading skeletons during data fetch.",
  "frontend/src/components/Header.tsx": "Renders the sticky header with navigation, authentication controls, theme toggle, and admin panel access. Handles smooth scrolling to sections, route navigation between home and blogs, and mobile menu.",
  "frontend/src/components/Hero.tsx": "Displays the hero section with customizable layout, background images (light/dark mode), and editable content. Applies extensive theme configuration including glassmorphism, spacing, positioning, and optional visual effects.",
  "frontend/src/components/hero/effects/MotionEffectLayer.tsx": "Renders animated canvas-based motion effects (wave or floating gradients) with Material Design elevation and shadows, using configurable speed and amplitude parameters.",
  "frontend/src/components/hero/effects/ParticleEffectLayer.tsx": "Renders animated canvas-based particle effects (bubbles, sparkles, confetti, or dots) with configurable intensity and speed, featuring Material Design shadows and smooth transitions.",
  "frontend/src/components/hero/effects/VectorEffectLayer.tsx": "Renders SVG-based vector effects (geometric patterns or animated paths) with glow filters, configurable complexity, and color schemes using Tailwind classes.",
  "frontend/src/components/hero/FloatingMedicalIconsLayer.tsx": "Empty file with no content.",
  "frontend/src/components/hero/HeroMultiEffectsLayer.tsx": "Conditionally renders particle, motion, and vector effect layers based on configuration and enabled state.",
  "frontend/src/components/hero/HeroSpecialEffectsLayer.tsx": "Empty file with no content.",
  "frontend/src/components/Overview.tsx": "Displays an overview section with editable content and four highlight cards (Expert Care, Patient-Centered, Experienced, Trusted) with loading skeletons and error handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name to complete profile setup, preventing dismissal until submitted.",
  "frontend/src/components/Reviews.tsx": "Displays patient reviews in a horizontal scrollable carousel with auto-scroll functionality, manual navigation buttons, and configurable settings for speed and max reviews.",
  "frontend/src/components/Services.tsx": "Renders a grid of medical service cards with loading states, error handling, and animated hover effects.",
  "frontend/src/components/SocialMedia.tsx": "Displays social media platform icons with links in a centered row, supporting Facebook, Twitter/X, Instagram, LinkedIn, YouTube, and GitHub with customizable icon sizes.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with authentication, creating anonymous or authenticated actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useHeroLayoutPreset.ts": "Analyzes hero images to determine optimal layout configuration (content position, overlay strength, container width, text size) based on brightness, contrast, visual weight, and busyness metrics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, website content, footer content, doctor credentials, clinics, services, reviews, blog posts, and admin authorization checks.",
  "frontend/src/ic-assets.json": "Configuration file specifying that `.well-known` directory should not be ignored during IC asset deployment.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a high-tech multicolor design system for both light and dark modes, including primary (electric blue), secondary (purple), accent (cyan), and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/heroImageAnalysis.ts": "Client-side image analysis utility that analyzes hero background images for brightness, contrast, left/right visual weight, and busyness using canvas-based pixel processing to determine optimal content layout.",
  "frontend/src/utils/heroThemeDefaults.ts": "Utility functions for safely handling hero theme data including bigint conversions, clamping values, normalizing theme objects, and extracting effective dimensions and positions with fallback defaults.",
  "frontend/src/utils/particleEffectTypes.ts": "Defines metadata for particle effect types (bubbles, confetti, sparkles, dots, rings, swirls, lines, medical symbols) with helper functions to retrieve labels and descriptions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and methods to clear sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining dark mode, content paths, custom theme extensions including colors (using CSS variables), container settings, border radius, and custom box shadows for elevation and glow effects.",
  "project_state.json": "Project state metadata tracking a reversion effort to Version 62, documenting existing features to remove (TextFormattingManager and related components) and pending backend restoration tasks."
}