{
  "backend/main.mo": "Main Motoko actor defining all backend types (HeroSectionTheme, Clinic, Service, SocialMediaLink, etc.) and including authorization and blob storage mixins for managing website content, user profiles, and access control.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features: fixing footer settings error in admin panel, making footer headings consistent with UI styling, and fixing admin panel mobile layout crowding.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing their functionality, error handling, loading states, and styling approaches including Header, Footer, Hero, AdminPanel, and various manager components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, primary, secondary, accent, destructive, borders, and sidebar elements.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Dr. Malay Akechan - General Physician', and script reference to main.tsx.",
  "frontend/src/.well-known/ic-domains": "Internet Computer domain configuration file specifying the custom domain 'drmalay.in'.",
  "frontend/src/App.tsx": "Main React application component with ErrorBoundary, ThemeProvider, authentication state management, hash-based routing between home and blogs views, ProfileSetupModal, and conditional AdminPanel rendering.",
  "frontend/src/components/About.tsx": "About section component displaying doctor profile with EditableImage, EditableContent for biography, DoctorCredentialsCard, loading skeletons, error handling, and Material Design styling with gradient effects.",
  "frontend/src/components/admin/ClinicsManager.tsx": "Admin interface for managing clinic entries with CRUD operations, image upload with progress tracking, and form validation. Handles clinic data including name, address, contact details, hours, map links, and booking URLs.",
  "frontend/src/components/admin/ContentManager.tsx": "Admin component for managing website images (hero background, doctor photos, clinic images) and hero section content (headline, subtext, buttons). Supports light/dark mode image uploads with preview and CRUD operations.",
  "frontend/src/components/admin/FooterManager.tsx": "Admin component for managing footer content including contact information, copyright text, footer sections with drag-and-drop reordering, and quick links. Tracks changes and provides save functionality.",
  "frontend/src/components/admin/HeroThemeManager.tsx": "Admin component for configuring hero section visual theme settings including theme type, particle effects, motion effects with patterns, vector effects, and spacing. Provides UI controls for adjusting BigInt and string values.",
  "frontend/src/components/admin/ReviewsManager.tsx": "Admin component for managing patient reviews with CRUD operations, star ratings, optional patient images with upload/preview, and review panel settings. Includes submission guards to prevent duplicate submissions.",
  "frontend/src/components/admin/ServicesManager.tsx": "Admin component for managing medical services with basic CRUD operations. Handles service name and description fields with dialog-based add/edit forms and delete confirmation.",
  "frontend/src/components/admin/SocialMediaManager.tsx": "Admin component for managing social media links with CRUD operations, including platform, display name, URL, icon size, order, and visibility settings. Uses dialog forms for add/edit operations and displays links in a sortable list.",
  "frontend/src/components/AdminPanel.tsx": "Main admin panel component with tabbed interface for managing content, hero theme, clinics, services, reviews, social media, and footer sections. Includes a close button and renders specialized manager components for each tab.",
  "frontend/src/components/blogs/BlogDetail.tsx": "Displays a single blog post with formatted date, author, and rich content rendering. Includes an edit button for admin users.",
  "frontend/src/components/blogs/BlogList.tsx": "Renders a list of blog posts sorted by creation date with preview text, metadata, and admin controls for editing and deleting posts. Includes confirmation dialog for deletions.",
  "frontend/src/components/blogs/BlogPostEditorDialog.tsx": "Dialog component for creating and editing blog posts with support for multiple content blocks (text and images), image upload with progress tracking, and rich text editing. Handles post creation/update mutations and validation.",
  "frontend/src/components/blogs/RichContentRenderer.tsx": "Renders blog post content elements (text, images, videos) with support for both formatted HTML and plain text, including proper styling and lazy loading for media.",
  "frontend/src/components/blogs/RichTextEditor.tsx": "WYSIWYG rich text editor with toolbar for formatting (headings, bold, italic, lists, links, quotes) using contentEditable and document.execCommand API.",
  "frontend/src/components/BlogsPage.tsx": "Blog listing and detail page component that displays all blog posts, handles post selection, and provides admin functionality for creating/editing posts via a dialog. Shows loading skeletons and empty states for non-admin users when no posts exist.",
  "frontend/src/components/Clinics.tsx": "Displays a grid of clinic cards with location, phone, hours, and booking information. Shows loading skeletons, handles errors, and hides section for non-admin users when no clinics exist.",
  "frontend/src/components/DoctorCredentialsCard.tsx": "Card component displaying doctor's professional credentials including name, qualifications, specializations, experience, and achievements with an editable profile image. Provides admin edit dialog for updating credential information.",
  "frontend/src/components/EditableContent.tsx": "Reusable component for inline editing of website content fields (overview/about) with textarea input. Shows edit button on hover for admins and handles save/cancel actions with mutation updates.",
  "frontend/src/components/EditableFooterContent.tsx": "Inline editable component for footer fields (address, phone, email, copyright) with text input. Provides hover-based edit controls for admins and updates footer content via mutation.",
  "frontend/src/components/EditableHeroContent.tsx": "Provides an editable component for hero section content (headline, subtext, buttons) with inline editing dialog for admins. Supports both text and button rendering with gradient/glassmorphic styling and hover effects.",
  "frontend/src/components/EditableImage.tsx": "Handles image uploads and updates with support for light/dark mode variants, showing upload progress and admin-only edit controls. Falls back to placeholder icon when no image is present.",
  "frontend/src/components/Footer.tsx": "Renders the website footer with contact info, quick links, custom sections, and social media icons. Includes admin editing capabilities and background effects layer with theme support.",
  "frontend/src/components/Header.tsx": "Sticky header with navigation menu, authentication controls, theme toggle, and admin panel access. Handles smooth scrolling to sections and routing between home and blogs views.",
  "frontend/src/components/Hero.tsx": "Main hero section component with customizable layout, background images (light/dark mode), glassmorphic effects, and editable content. Supports extensive theming options including positioning, spacing, transparency, and particle effects.",
  "frontend/src/components/hero/effects/MotionEffectLayer.tsx": "Renders animated canvas-based motion effects (wave or floating gradients) with Material Design elevation and shadows, using configurable speed and amplitude parameters.",
  "frontend/src/components/hero/effects/ParticleEffectLayer.tsx": "Renders animated canvas-based particle effects (bubbles, sparkles, confetti, or dots) with configurable intensity and speed, featuring Material Design elevation and smooth transitions.",
  "frontend/src/components/hero/effects/VectorEffectLayer.tsx": "Renders SVG-based vector effects (geometric patterns or animated paths) with glow filters, configurable complexity, and color schemes using Tailwind classes.",
  "frontend/src/components/hero/FloatingMedicalIconsLayer.tsx": "Empty file with no content.",
  "frontend/src/components/hero/HeroMultiEffectsLayer.tsx": "Composite layer component that conditionally renders particle, motion, and vector effects based on their enabled states and overall layer enablement.",
  "frontend/src/components/hero/HeroSpecialEffectsLayer.tsx": "Empty file with no content.",
  "frontend/src/components/Overview.tsx": "Displays an overview section with editable content and four highlight cards (Expert Care, Patient-Centered, Experienced, Trusted) with icons and gradients. Includes loading skeletons, error handling, and admin-only editing capabilities.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name for profile setup. Prevents closing until the form is submitted and uses a mutation hook to save the profile.",
  "frontend/src/components/Reviews.tsx": "Displays patient reviews in a horizontal scrollable carousel with auto-scroll functionality, manual navigation buttons, and configurable settings (max reviews, scroll speed). Includes deduplication logic and loading/error states.",
  "frontend/src/components/Services.tsx": "Renders a grid of medical service cards with gradient accents and hover effects. Fetches services from the backend and shows loading skeletons or error alerts when appropriate.",
  "frontend/src/components/SocialMedia.tsx": "Displays social media links as icon buttons with platform-specific icons (Facebook, Twitter, Instagram, etc.) and gradient backgrounds. Filters visible links and supports custom icon sizing.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor, initializing access control with admin token and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useHeroLayoutPreset.ts": "Analyzes hero images to determine optimal layout configuration (content position, overlay strength, container width, text size) based on brightness, contrast, visual weight, and busyness metrics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, website content, footer content, doctor credentials, clinics, services, reviews, blog posts, and admin authorization checks.",
  "frontend/src/ic-assets.json": "Configuration file specifying that `.well-known` directory should not be ignored during asset processing.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a high-tech multicolor design system for both light and dark modes, including primary (electric blue), secondary (purple), accent (cyan), and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/utils/heroImageAnalysis.ts": "Client-side image analysis utility that analyzes hero background images for brightness, contrast, left/right visual weight, and busyness to determine optimal content layout presets.",
  "frontend/src/utils/heroThemeDefaults.ts": "Utility functions for safely handling hero theme data including bigint conversions, clamping values, normalizing theme objects, and extracting effective dimensions and positions with fallbacks.",
  "frontend/src/utils/particleEffectTypes.ts": "Defines metadata for particle effect types (bubbles, confetti, sparkles, dots, rings, swirls, lines, medical symbols) with helper functions to retrieve labels and descriptions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and methods to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including color palette (using CSS variables), container settings, border radius, box shadows with elevation and glow effects, and integrating typography, container queries, and animate plugins.",
  "project_state.json": "Project state file tracking three bug fix features: footer settings error in admin panel, footer section heading styling inconsistency, and admin panel settings menu mobile layout issues."
}