{
  "backend/main.mo": "Main backend actor defining authorization, storage mixins, and extensive type models for hero themes, visual effects, clinics, services, and social media.",
  "backend/migration.mo": "Migration module containing old type definitions to support data transformation from the previous schema to the updated backend types.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, related files, components, and test coverage for hero theme particle effect enhancements.",
  "frontend-file-summaries.txt": "Pre-generated summaries of many frontend files describing their roles in the UI, data fetching, admin tools, and visual components.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling rules.",
  "frontend/index.html": "HTML entry point that loads the frontend React application.",
  "frontend/src/.well-known/ic-domains": "Domain configuration file specifying the IC domain used by the frontend.",
  "frontend/src/App.tsx": "Root React component handling authentication, admin panel toggling, profile setup, theming, and rendering all main site sections.",
  "frontend/src/components/About.tsx": "Renders the About section, handling loading, error, admin editing, doctor image, text content, and credentials.",
  "frontend/src/components/admin/ClinicsManager.tsx": "Admin UI for adding, editing, and deleting clinics, including image upload with progress tracking and form dialogs.",
  "frontend/src/components/admin/ContentManager.tsx": "Admin tool for managing website images and hero section text, supporting uploads, editing, and predefined image configs.",
  "frontend/src/components/admin/HeroThemeManager.tsx": "Admin interface for editing hero section theme settings with live state updates, validation, and save functionality.",
  "frontend/src/components/admin/ServicesManager.tsx": "UI for listing, adding, editing, and deleting services using dialog forms and mutation hooks.",
  "frontend/src/components/admin/SocialMediaManager.tsx": "Admin interface to manage social media links with validation, ordering, visibility, and CRUD operations.",
  "frontend/src/components/AdminPanel.tsx": "Displays the admin panel UI with tabs for managing content, clinics, services, social media, and hero theme.",
  "frontend/src/components/Clinics.tsx": "Fetches and displays clinic locations with loading/error states and admin visibility handling.",
  "frontend/src/components/DoctorCredentialsCard.tsx": "Shows doctor credentials with editable fields and image when admin, using a dialog for updates.",
  "frontend/src/components/EditableContent.tsx": "Allows admins to edit website text fields with inline editing and save/cancel controls.",
  "frontend/src/components/EditableFooterContent.tsx": "Provides inline editing for footer fields like address, phone, email, and copyright for admins.",
  "frontend/src/components/EditableHeroContent.tsx": "Enables editing of hero section text and buttons, using a dialog for admin modifications.",
  "frontend/src/components/EditableImage.tsx": "Component that displays an image and allows admins to upload or update standard and dark‑mode versions with progress tracking.",
  "frontend/src/components/Footer.tsx": "Fetches and displays footer content, social links, and contact info with admin editing support and loading/error states.",
  "frontend/src/components/Header.tsx": "Header with navigation, theme toggle, Internet Identity login/logout, and optional admin panel toggle.",
  "frontend/src/components/Hero.tsx": "Hero section rendering dynamic content, background images, layout presets, admin editing, and theme-aware visual effects.",
  "frontend/src/components/hero/effects/MotionEffectLayer.tsx": "Canvas-based motion effect renderer supporting wave and floating gradient animations tied to config values.",
  "frontend/src/components/hero/effects/ParticleEffectLayer.tsx": "Canvas renderer generating particle animations such as bubbles, sparkles, dots, confetti, and rings based on effect settings.",
  "frontend/src/components/hero/effects/VectorEffectLayer.tsx": "SVG-based animated vector patterns or paths driven by complexity, color scheme, and effect type.",
  "frontend/src/components/hero/FloatingMedicalIconsLayer.tsx": "Empty placeholder file for a hero-layer component.",
  "frontend/src/components/hero/HeroMultiEffectsLayer.tsx": "Combines particle, motion, and vector effect layers and renders them conditionally based on config and enabled state.",
  "frontend/src/components/hero/HeroSpecialEffectsLayer.tsx": "Empty placeholder file for special effects layer in the hero section.",
  "frontend/src/components/Overview.tsx": "Overview section showing highlight cards and editable overview text, with loading and error handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting users to enter and save their name to complete profile setup.",
  "frontend/src/components/Services.tsx": "Displays a services section with loading and error states, fetching services and admin status before rendering cards or hiding the section.",
  "frontend/src/components/SocialMedia.tsx": "Fetches social media links and admin status, showing icons for visible links with loading and error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useHeroLayoutPreset.ts": "Analyzes a hero image to compute an optimal layout preset with overlay, sizing, and positioning adjustments.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for managing Internet Identity authentication, including login state, identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, admin status, website content, and related backend data using an actor and identity.",
  "frontend/src/ic-assets.json": "Specifies asset rules for the build, including handling of the .well-known directory.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes, including an extensive color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/heroImageAnalysis.ts": "Implements client‑side image analysis to compute brightness, contrast, weight distribution, and busyness for hero images.",
  "frontend/src/utils/heroThemeDefaults.ts": "Provides utilities for validating, normalizing, and safely converting hero theme configuration values, including bigint helpers.",
  "frontend/src/utils/particleEffectTypes.ts": "Defines metadata for particle effect types and helpers for retrieving human‑readable labels and descriptions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them from either session or the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, shadows, radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, including existing features, new feature requests, metadata, and version info."
}