{
  "backend/main.mo": "Main Motoko actor defining all backend types (HeroSectionTheme, Clinic, Service, SocialMediaLink, FooterSection, etc.) and including authorization and blob storage mixins for state management.",
  "feature_evidence.json": "Feature evidence report documenting two features: reverting code to Version 59 and fixing the footer settings error in the admin panel, both targeting FooterManager.tsx.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing their functionality, error handling, loading states, and Material Design styling patterns.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for background, foreground, primary, secondary, accent, borders, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and title \"Dr. Malay Akechan - General Physician\".",
  "frontend/src/.well-known/ic-domains": "Internet Computer domain configuration file specifying the custom domain \"drmalay.in\".",
  "frontend/src/App.tsx": "Root React component with ErrorBoundary, ThemeProvider, authentication state, profile setup modal, hash-based routing between home and blogs views, and conditional AdminPanel rendering.",
  "frontend/src/components/About.tsx": "About section component displaying doctor profile image and content with loading skeletons, error handling, EditableContent/EditableImage support, and DoctorCredentialsCard integration.",
  "frontend/src/components/admin/ClinicsManager.tsx": "Admin interface for managing clinic records with CRUD operations, supporting image uploads with progress tracking and form fields for name, address, contact details, hours, map link, and booking URL.",
  "frontend/src/components/admin/ContentManager.tsx": "Admin panel for managing website images (including predefined slots like hero background and doctor headshot) and hero section content with support for light/dark mode images and upload progress tracking.",
  "frontend/src/components/admin/FooterManager.tsx": "Admin component for managing footer content including contact info, copyright, sections, and quick links with drag-and-drop reordering and save functionality.",
  "frontend/src/components/admin/HeroThemeManager.tsx": "Admin component for configuring hero section theme settings including theme type, particle effects, motion effects, vector effects, and spacing with real-time preview and save functionality.",
  "frontend/src/components/admin/ReviewsManager.tsx": "Admin component for managing patient reviews with CRUD operations, image upload support, and review panel settings configuration using tabs and dialogs.",
  "frontend/src/components/admin/ServicesManager.tsx": "Admin component for managing medical services with add, edit, and delete operations using a dialog form for service name and description.",
  "frontend/src/components/admin/SocialMediaManager.tsx": "Admin component for managing social media links with CRUD operations, visibility toggles, ordering, and icon size configuration.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel container with seven responsive tabs (Content, Hero, Clinics, Services, Reviews, Social, Footer) using horizontal scrolling on mobile and close button.",
  "frontend/src/components/blogs/BlogDetail.tsx": "Component for displaying a single blog post with formatted date, author info, rich content rendering, and conditional edit button for admins.",
  "frontend/src/components/blogs/BlogList.tsx": "Displays a list of blog posts with sorting by creation date, preview text extraction, and admin controls for editing/deleting posts. Includes confirmation dialogs for deletion and toast notifications for user feedback.",
  "frontend/src/components/blogs/BlogPostEditorDialog.tsx": "Modal dialog for creating and editing blog posts with support for multiple content blocks (text and images), rich text editing, image upload with progress tracking, and validation. Handles both new post creation and existing post updates.",
  "frontend/src/components/blogs/RichContentRenderer.tsx": "Renders blog post content elements (text, images, videos) with support for both formatted HTML and plain text, including proper styling, lazy loading for images, and figure captions.",
  "frontend/src/components/blogs/RichTextEditor.tsx": "WYSIWYG rich text editor component with toolbar buttons for formatting (headings, bold, italic, lists, links, quotes) using contentEditable and document.execCommand API.",
  "frontend/src/components/BlogsPage.tsx": "Main blog page component that displays a list of blog posts or a selected post detail, with admin controls for creating and editing posts. Includes loading states, empty states, and a dialog for post editing.",
  "frontend/src/components/Clinics.tsx": "Displays a grid of clinic location cards with details like address, phone, hours, and images. Handles loading states, errors, and conditionally renders based on admin status and clinic availability.",
  "frontend/src/components/DoctorCredentialsCard.tsx": "Card component showing doctor credentials including name, qualifications, specializations, experience, and achievements with an editable profile image. Provides admin edit dialog for updating credential information.",
  "frontend/src/components/EditableContent.tsx": "Reusable component for inline editing of website content fields (overview/about) with admin controls. Supports multiline text editing with save/cancel actions and toast notifications.",
  "frontend/src/components/EditableFooterContent.tsx": "Inline editable component for footer content fields (address, phone, email, copyright) with admin-only edit mode. Uses input fields for editing and displays content with hover edit buttons.",
  "frontend/src/components/EditableHeroContent.tsx": "Manages editable hero section content including headline, subtext, and buttons with links through a dialog interface. Supports both text and button variants with admin-only edit controls.",
  "frontend/src/components/EditableImage.tsx": "A React component that displays images with admin editing capabilities, supporting light/dark mode variants, file uploads with progress tracking, and fallback placeholders when no image is present.",
  "frontend/src/components/Footer.tsx": "Footer component that displays contact information, navigation quick links, custom sections, and social media icons with sorting and admin editing capabilities, plus optional background effects from hero theme.",
  "frontend/src/components/Header.tsx": "Sticky header component with navigation menu, authentication controls via Internet Identity, theme toggle, and admin panel access, supporting both desktop and mobile layouts.",
  "frontend/src/components/Hero.tsx": "Hero section component with customizable layout presets, background images (light/dark mode), glassmorphism effects, particle/motion/vector effects, and editable content with manual positioning options.",
  "frontend/src/components/hero/effects/MotionEffectLayer.tsx": "Canvas-based animation layer rendering wave or floating gradient motion effects with Material Design elevation, shadows, and configurable speed/amplitude parameters.",
  "frontend/src/components/hero/effects/ParticleEffectLayer.tsx": "Canvas-based particle system rendering bubbles, sparkles, or confetti with Material Design shadows, configurable intensity/speed, and smooth animations including rotation and pulsing effects.",
  "frontend/src/components/hero/effects/VectorEffectLayer.tsx": "Renders animated SVG vector effects (geometric patterns or animated paths) for hero sections with configurable complexity, color schemes, and glow filters.",
  "frontend/src/components/hero/FloatingMedicalIconsLayer.tsx": "Empty file with no content.",
  "frontend/src/components/hero/HeroMultiEffectsLayer.tsx": "Composite layer component that conditionally renders particle, motion, and vector effects based on their enabled state and configuration.",
  "frontend/src/components/hero/HeroSpecialEffectsLayer.tsx": "Empty file with no content.",
  "frontend/src/components/Overview.tsx": "Overview section displaying four highlight cards with icons and editable content, featuring loading skeletons, error handling, and animated background accent elements.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name for profile setup, preventing dismissal until completed and using mutation hooks to save the profile.",
  "frontend/src/components/Reviews.tsx": "Displays customer reviews in a scrollable carousel with auto-scroll functionality, supporting manual navigation, deduplication, and configurable settings like max reviews and scroll speed.",
  "frontend/src/components/Services.tsx": "Renders a grid of medical services with gradient styling and hover effects, showing loading skeletons during data fetch and hiding the section when no services exist for non-admin users.",
  "frontend/src/components/SocialMedia.tsx": "Displays social media links with platform-specific icons (Facebook, Twitter, Instagram, etc.) in a centered grid layout, hiding the section when no visible links exist for non-admin users.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useHeroLayoutPreset.ts": "Analyzes hero images to determine optimal layout presets (left/right/centered/bottom-overlay) based on brightness, contrast, visual weight, and busyness, with dark mode adjustments.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, website content, footer content, doctor credentials, reviews, blog posts, and authorization checks.",
  "frontend/src/ic-assets.json": "Configuration file specifying that .well-known directory should not be ignored during IC asset deployment.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a high-tech multicolor design system for light and dark modes, including primary (electric blue), secondary (purple), accent (cyan), and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/heroImageAnalysis.ts": "Client-side utility that analyzes hero background images for brightness, contrast, left/right visual weight, and busyness using canvas-based image processing to determine optimal content layout presets.",
  "frontend/src/utils/heroThemeDefaults.ts": "Provides utility functions for safely handling hero theme data including bigint conversions, clamping values, normalizing theme objects, and extracting effective dimensions and positions with fallback defaults.",
  "frontend/src/utils/particleEffectTypes.ts": "Defines metadata for all supported particle effect types (bubbles, confetti, sparkles, etc.) and provides helper functions to retrieve labels and descriptions for each effect type.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including color schemes (primary, secondary, accent, etc.), container settings, border radius variables, and custom box shadows for elevation and glow effects.",
  "project_state.json": "Project metadata tracking architectural notes, known issues (footer settings error in v60), and feature requests to revert to version 59 and fix the admin panel footer settings error."
}