{
  "kind": "build_request",
  "title": "Fix duplicate review submissions and enhance blogs, footer, and hero theming",
  "projectName": "Dr Malay Site",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the patient review submission flow so that creating a new review cannot result in duplicate review entries being stored or displayed (even if the user clicks submit multiple times, the request retries, or the UI re-renders).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "posting patient reviews is creating duplicates. Fix the glitch."
        ]
      },
      "acceptanceCriteria": [
        "Submitting a new review once results in exactly one new review appearing in the admin reviews list and on the public Reviews section.",
        "Rapid repeated clicks on the submit button (or enter key) while a submission is in progress do not create additional review records.",
        "If the same create-review request is retried (e.g., transient failure + retry), the backend does not create a second record for the same intended submission.",
        "No regression: editing an existing review updates the existing record and does not create a new one."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add user-friendly text formatting controls for admins while writing blog posts, covering common formatting options (e.g., headings, bold/italic/underline, links, ordered/unordered lists, quotes) and ensure the formatted content is stored and rendered correctly on blog list/detail views.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add all text formatting options while admin writes the blog posts. Keep it user friendly."
        ]
      },
      "acceptanceCriteria": [
        "The blog post editor provides a visible formatting toolbar for text blocks that can apply formatting without the admin needing to manually type markup.",
        "Formatted text is rendered correctly in the blog detail view and matches the formatting applied in the editor.",
        "Existing blog posts created before this change still render correctly (no breaking changes to previously stored content)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a “Blogs” option to the Footer Quick Links that navigates users to the blogs page using the app’s existing hash-based routing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add \"Blogs\" option in Footer Quick links."
        ]
      },
      "acceptanceCriteria": [
        "Footer Quick Links includes a link labeled \"Blogs\".",
        "Clicking \"Blogs\" navigates to the blogs page (without a full page refresh) and works from any current section/page.",
        "Existing quick links (Home/About/Services/Clinics/Contact) keep their current behavior (smooth scroll for section anchors)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Expand the hero theme system with additional Material Design-inspired effects and transitions, and allow multiple effect types to be enabled/configured in the hero theme section without visual glitches or performance issues.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add more and multiple types of material design effects and transition in hero theme section"
        ]
      },
      "acceptanceCriteria": [
        "Hero theme settings expose additional effect/transition options that follow a Material Design-like motion/elevation style.",
        "Multiple hero effects can be enabled simultaneously and render together correctly.",
        "Switching hero effect settings results in smooth transitions rather than abrupt changes.",
        "All effect type options exposed in the admin hero theme UI are actually supported by the hero rendering layer (no 'selectable but does nothing' options)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Make the hero section background controls more robust by improving configurability and reliability: provide clearer admin controls for background behavior (including sensible defaults/validation), handle missing light/dark background variants gracefully, and ensure the hero remains readable across different backgrounds.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make the hero section background control more robust"
        ]
      },
      "acceptanceCriteria": [
        "Admin-facing background controls validate and clamp inputs to safe ranges (no broken hero layout due to out-of-range values).",
        "If no hero background image exists, the hero still renders with an intentional fallback background and readable text.",
        "If a dark-mode background variant is missing, dark mode still renders acceptably (fallback to standard image or theme fallback) without runtime errors.",
        "Hero text/buttons remain readable (contrast) across typical background images using overlays/gradients according to theme settings."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo changes only if stored state schema must change.",
    "Do not edit files under frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui). Compose existing UI components instead."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers (only Internet Identity is supported).",
    "Do not introduce external databases or non-Motoko backend services.",
    "Do not add real-time/WebSocket features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}