{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add comprehensive admin panel for footer section management",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a new FooterManager admin component that allows editing of all footer sections (Contact Information, Quick Links, Social Media) and their headings",
      "acceptanceCriteria": [
        "FooterManager component displays all current footer sections with their headings",
        "Admin can edit the heading text for each footer section",
        "Admin can modify contact information fields (address, phone, email)",
        "Admin can edit or add/remove quick navigation links",
        "Changes are persisted to the backend and reflected in the Footer component"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/FooterManager.tsx",
          "operation": "create",
          "description": "Create FooterManager component with forms for editing all footer sections including section titles, contact information (address, phone, email), quick navigation links (add/edit/delete), and copyright text. Use backend's FooterContent type and updateFooterContent mutation. Include loading states, error handling with Alert components, and success notifications. Follow the same UI patterns as other admin manager components (ClinicsManager, ServicesManager)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useUpdateFooterContent mutation hook that calls actor.updateFooterContent and invalidates ['footerContent'] query cache on success. Follow the same pattern as useUpdateWebsiteContent and other existing mutation hooks."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement drag-and-drop or up/down controls in FooterManager to allow reordering of footer sections",
      "acceptanceCriteria": [
        "Admin can change the display order of footer sections (Contact, Quick Links, Social Media)",
        "Reordering is intuitive using either drag-and-drop or arrow buttons",
        "New section order is saved and persists across sessions",
        "Footer component renders sections in the admin-specified order"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/FooterManager.tsx",
          "operation": "modify",
          "description": "Add section reordering UI with up/down arrow buttons for each footer section. Update the FooterSection.order field when reordering and save to backend. Ensure sections array is sorted by order field before rendering. Include visual feedback during reordering operations."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add FooterManager tab to the AdminPanel component alongside existing Content, Hero Theme, Clinics, Services, Reviews, and Social Media tabs",
      "acceptanceCriteria": [
        "New 'Footer' tab appears in AdminPanel component",
        "Tab displays the FooterManager component when selected",
        "Tab follows the same design pattern as existing admin tabs"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "modify",
          "description": "Add a new 'Footer' tab to the existing Tabs component in AdminPanel. Import and render FooterManager component when the Footer tab is selected. Follow the exact same tab structure and naming convention as the existing six tabs (Content & Images, Hero Theme, Clinics, Services, Reviews, Social Media)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update Footer component to render sections dynamically based on admin-configured order and headings from backend",
      "acceptanceCriteria": [
        "Footer fetches section configuration from backend",
        "Footer renders sections in the order specified by admin",
        "Footer displays custom heading text for each section",
        "Layout remains responsive and consistent with existing UI design"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update Footer component to render sections dynamically based on the FooterContent.sections array sorted by order field. Replace hardcoded section headings with section.title from backend. Maintain existing visual styling, animations, and EditableFooterContent integration. Ensure sections are responsive and handle empty sections gracefully. Keep the copyright, contact info, and quick links rendering but make section titles configurable."
        }
      ]
    }
  ]
}