{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Revert application to Version 62 state",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Restore all frontend components, styles, and functionality to the exact state from Version 62, removing any changes introduced in Version 63",
      "acceptanceCriteria": [
        "All frontend components match Version 62 implementation",
        "UI appearance and behavior are identical to Version 62",
        "No Version 63 frontend features or changes remain"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Remove text formatting props and dynamic styling logic. Restore static styling as it existed in Version 62, removing any textFormatting prop usage and related conditional styling."
        },
        {
          "path": "frontend/src/components/Overview.tsx",
          "operation": "modify",
          "description": "Remove text formatting props and dynamic styling logic. Restore static styling for the overview section and highlight cards as they existed in Version 62."
        },
        {
          "path": "frontend/src/components/About.tsx",
          "operation": "modify",
          "description": "Remove text formatting props and dynamic styling logic. Restore static styling for the about section as it existed in Version 62."
        },
        {
          "path": "frontend/src/components/Services.tsx",
          "operation": "modify",
          "description": "Remove text formatting props and dynamic styling logic. Restore static styling for the services grid as it existed in Version 62."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Remove text formatting props and dynamic styling logic. Restore static styling for the footer as it existed in Version 62."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove any text formatting state management, hooks, or props being passed to child components. Restore Version 62 state where components receive only the props they had originally."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Remove the TextFormattingManager component and all text formatting controls that were added in Version 63",
      "acceptanceCriteria": [
        "TextFormattingManager component is removed from the admin panel",
        "Text formatting tab is removed from AdminPanel.tsx",
        "All text formatting state management hooks are removed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/TextFormattingManager.tsx",
          "operation": "delete",
          "description": "Delete the TextFormattingManager component file that was added in Version 63."
        },
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "modify",
          "description": "Remove the TextFormattingManager import and the 'Text Formatting' tab from the admin panel. Remove any text formatting state or props related to this feature. Restore the admin panel to its Version 62 tab structure (Content, Hero Theme, Clinics, Services, Reviews, Social Media, Footer)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove any text formatting related hooks (e.g., useGetTextFormatting, useUpdateTextFormatting) that were added in Version 63. Restore the hooks file to its Version 62 state with only the original query hooks."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Remove text formatting props and dynamic styling from all homepage components (Hero, Overview, About, Services, Footer) that were modified in Version 63",
      "acceptanceCriteria": [
        "Homepage components use static styling as in Version 62",
        "No dynamic text formatting is applied to any component",
        "All components render with Version 62 appearance"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Verify removal of all textFormatting props, inline style objects derived from text formatting data, and any conditional className or style attributes related to dynamic text formatting. Ensure only hardcoded Tailwind classes and static styles remain."
        },
        {
          "path": "frontend/src/components/Overview.tsx",
          "operation": "modify",
          "description": "Verify removal of all textFormatting props and dynamic style generation. Restore static Tailwind classes for headings, body text, and card content as they existed in Version 62."
        },
        {
          "path": "frontend/src/components/About.tsx",
          "operation": "modify",
          "description": "Verify removal of all textFormatting props and dynamic styling. Restore static classes for section heading and body text as they existed in Version 62."
        },
        {
          "path": "frontend/src/components/Services.tsx",
          "operation": "modify",
          "description": "Verify removal of all textFormatting props and dynamic styling. Restore static classes for service titles and descriptions as they existed in Version 62."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Verify removal of all textFormatting props and dynamic styling. Restore static classes for footer headings, links, and body text as they existed in Version 62."
        }
      ]
    }
  ]
}